Public Member Functions | Friends | List of all members
ACAPI::MEP::v1::FlexibleSegmentDefault Class Referencefinal
MEP Element Manager
The FlexibleSegmentDefault contains the necessary non-geometric data for creating a FlexibleSegment element. More...
#include <MEPFlexibleSegmentDefault.hpp>
 Inheritance diagram for ACAPI::MEP::v1::FlexibleSegmentDefault:
 Public Member Functions
Result< UniqueID >  | Place (const std::vector< API_Coord3D > &controlPoints, const Orientation &startOrientation, const Orientation &endOrientation, const std::optional< API_Guid > &requiredId=std::nullopt) const
Places a FlexibleSegment element based on this Default.
double  | GetWidth () const
double  | GetHeight () const
ConnectorShape  | GetShape () const
 Public Member Functions inherited from ACAPI::MEP::v1::ElementDefault
std::optional< double >  | GetInsulationThickness () const
uint32_t  | GetPortCount () const
Result< ConnectorShape >  | GetShapeOfPort (uint32_t portIdx) const
Domain  | GetDomain () const
API_Guid  | GetObjectId () const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
 void  | RemoveInsulation ()
Removes the insulation.
Result< void >  | SetInsulationThickness (double insulationThickness)
Sets the thickness of insulation on the ElementDefault.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ElementDefault.
 Friends
 class  | FlexibleSegment
Result< FlexibleSegmentDefault >  | CreateFlexibleSegmentDefault ()
Creates a FlexibleSegmentDefault.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::v1::ElementDefault
ElementDefault (std::shared_ptr< Impl::IElementDefaultImpl > impl)
Modifier (ElementDefault &)
Detailed Description
The FlexibleSegmentDefault contains the necessary non-geometric data for creating a FlexibleSegment element.
Since
Archicad 27
Example code snippet from Test / New MEP
Pickup and Getters
 // Write Defaults
 FlexibleSegmentDefault flexibleSegmentDefault = flexibleSegment->PickUpDefault ();
 reporter.SetTabCount (0);
 reporter.Add ("Default Flexible Segment:");
 reporter.SetTabCount (1);
 reporter.Add ("Width", flexibleSegmentDefault.GetWidth ());
 reporter.Add ("Height", flexibleSegmentDefault.GetHeight ());
 reporter.Add ("Shape", flexibleSegmentDefault.GetShape ());
 reporter.Write ();
 Placement
 auto ductFlexibleSegmentDefault = CreateFlexibleSegmentDefault ();
 if (ductFlexibleSegmentDefault.IsErr ())
 return ductFlexibleSegmentDefault.UnwrapErr ().kind;
 std::vector<API_Coord3D> controlPoints = {
 { 0.0, 30.0, 0.0 },
 { 2.0, 31.0, 0.0 },
 { 4.0, 29.0, 0.0 },
 { 6.0, 30.0, 0.0 }
 };
 Orientation startOrientation = { { -1.0, 0.0, 0.0 }, { 0.0, 1.0, 0.0 } };
 Orientation endOrientation = { { 1.0, 0.0, 0.0 }, { 0.0, 1.0, 0.0 } };
 ACAPI::Result<UniqueID> flexibleSegment = ductFlexibleSegmentDefault->Place (controlPoints, startOrientation, endOrientation, GSGuid2APIGuid (GS::Guid::GenerateGuid));
 if (flexibleSegment.IsErr ())
 return flexibleSegment.UnwrapErr ().kind;
 ACAPI_WriteReport ("Ventilation FlexibleSegment placed successfully", false);
Member Function Documentation
◆ GetHeight()
 double ACAPI::MEP::v1::FlexibleSegmentDefault::GetHeight  |  ( |   | ) |   const
Returns
Returns the height of the FlexibleSegment.
◆ GetShape()
 ConnectorShape ACAPI::MEP::v1::FlexibleSegmentDefault::GetShape  |  ( |   | ) |   const
Returns
Returns the shape of the FlexibleSegment.
◆ GetWidth()
 double ACAPI::MEP::v1::FlexibleSegmentDefault::GetWidth  |  ( |   | ) |   const
Returns
Returns the width of the FlexibleSegment.
◆ Place()
 Result< UniqueID > ACAPI::MEP::v1::FlexibleSegmentDefault::Place  |  ( |  const std::vector< API_Coord3D > &  |  controlPoints,
|  const Orientation &  |  startOrientation,
|  const Orientation &  |  endOrientation,
|  const std::optional< API_Guid > &  |  requiredId = std::nullopt
) |   |  const
Places a FlexibleSegment element based on this Default.
The implementation creates an Undoable Command Scope before executing the placement. This Command Scope is automatically closed after execution. When someone would like to group the placement of several routes and/or MEP elements together, it is recommended to create a single Command Scope. Doing this prevents the opening and closing of a Command Scope for every single created route and/or MEP element, therefore the performance should be improved.
Parameters
controlPoints | The control points the FlexibleSegment will be placed with.
startOrientation | The orientation of the start point of the FlexibleSegment, which is based on a direction vector and a rotation vector.
endOrientation | The orientation of the end point of the FlexibleSegment, which is based on a direction vector and a rotation vector.
requiredId | The guid to be set for the FlexibleSegment - optional parameter
Returns
If executed with success, returns the newly placed FlexibleSegment's uniqueId, otherwise Error.
Friends And Related Symbol Documentation
◆ CreateFlexibleSegmentDefault
 Result< FlexibleSegmentDefault > CreateFlexibleSegmentDefault  |  ( |   | )
friend
Creates a FlexibleSegmentDefault.
Returns
If able, returns a copy of Archicad's current Default of the Duct (Ventilation) FlexibleSegment tool, otherwise Error.